// написать программу, принимающую на вход число и выдающую его квадрат
Console.WriteLine("Введите число");
int num = int.Parse(Console.ReadLine());
Console.WriteLine("Квадрат введенного числа: " + num*num);